# Pandas

Powerful data manipulation library

In [2]:
import pandas as pd

In [3]:
# Series --> it is one dimensional array like object
# that can hold any data type. it is similar to coloumn
data = [1,2,3,4,5,6,7]
series=pd.Series(data)
print(series)

0    1
1    2
2    3
3    4
4    5
5    6
6    7
dtype: int64

In [4]:
# Creating series from dictionary
data={'a':1,'b':2,'c':3}

pd.Series(data)

a    1
b    2
c    3
dtype: int64

In [5]:
data=[12,20,30]
index=['a','b','c']
pd.Series(data,index=index)

a    12
b    20
c    30
dtype: int64

In [7]:
# Data frame --> it has multiple rows and coloumns

# Creating dataframes from dictionary
data={
    'name':['a','b','c'],
    'age':[24,31,20],
    'Grades':[20,30,40]
}

df=pd.DataFrame(data)
print(df)

  name  age  Grades
0    a   24      20
1    b   31      30
2    c   20      40

In [8]:
# Creating a dataframes from list of dictionaries

data =[
    {'name':'a','age':21,'city':'pune'},
    {'name':'b','age':22,'city':'nagar'},
    {'name':'c','age':24,'city':'pune'},
    {'name':'d','age':23,'city':'loanavla'},
    {'name':'e','age':27,'city':'pune'},
    {'name':'f','age':26,'city':'mumbai'}
]

df=pd.DataFrame(data)
print(df)

  name  age      city
0    a   21      pune
1    b   22     nagar
2    c   24      pune
3    d   23  loanavla
4    e   27      pune
5    f   26    mumbai

In [11]:
pd.read_csv('sales_data.csv')

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal
...,...,...,...,...,...,...,...,...,...
235,10236,2024-08-23,Home Appliances,Nespresso Vertuo Next Coffee and Espresso Maker,1,159.99,159.99,Europe,PayPal
236,10237,2024-08-24,Clothing,Nike Air Force 1 Sneakers,3,90.00,270.00,Asia,Debit Card
237,10238,2024-08-25,Books,The Handmaid's Tale by Margaret Atwood,3,10.99,32.97,North America,Credit Card
238,10239,2024-08-26,Beauty Products,Sunday Riley Luna Sleeping Night Oil,1,55.00,55.00,Europe,PayPal
239,10240,2024-08-27,Sports,Yeti Rambler 20 oz Tumbler,2,29.99,59.98,Asia,Credit Card

In [13]:
df=pd.read_csv('sales_data.csv')
print(df.head(5))

   Transaction ID        Date Product Category             Product Name  \
0           10001  2024-01-01      Electronics            iPhone 14 Pro
1           10002  2024-01-02  Home Appliances         Dyson V11 Vacuum
2           10003  2024-01-03         Clothing         Levi's 501 Jeans
3           10004  2024-01-04            Books        The Da Vinci Code
4           10005  2024-01-05  Beauty Products  Neutrogena Skincare Set

   Units Sold  Unit Price  Total Revenue         Region Payment Method
0           2      999.99        1999.98  North America    Credit Card
1           1      499.99         499.99         Europe         PayPal
2           3       69.99         209.97           Asia     Debit Card
3           4       15.99          63.96  North America    Credit Card
4           1       89.99          89.99         Europe         PayPal

In [14]:
# Accessing data from dataframes
df['Transaction ID'] # --> this is for accessing whole coloumn

0      10001
1      10002
2      10003
3      10004
4      10005
       ...
235    10236
236    10237
237    10238
238    10239
239    10240
Name: Transaction ID, Length: 240, dtype: int64

In [15]:
# For accessing row
df.loc[0]

Transaction ID              10001
Date                   2024-01-01
Product Category      Electronics
Product Name        iPhone 14 Pro
Units Sold                      2
Unit Price                 999.99
Total Revenue             1999.98
Region              North America
Payment Method        Credit Card
Name: 0, dtype: object